app/controllers/instructors_controller.rb

SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @instructor = Instructor.find(params[:id])